<?php
session_start();
include '../templates/head.php';
?>

<body>
    <div class="container">
        <?php
        include '../templates/header.php';
        ?>
        <h1>
            Главная
        </h1>
        <button type="button" id="test">Тест</button>
        <p>
            В&nbsp;книжном интернет магазине Вы&nbsp;можете выбрать любые книги на&nbsp;Ваш вкус, мы&nbsp;доставим все
            в&nbsp;сроки и&nbsp;в&nbsp;целостности. Также можно оформить книги под заказ и&nbsp;в&nbsp;аудиоформате.
            В&nbsp;книжном интернет магазине Вы&nbsp;можете выбрать любые книги на&nbsp;Ваш вкус, мы&nbsp;доставим все
            в&nbsp;сроки и&nbsp;в&nbsp;целостности. Также можно оформить книги под заказ и&nbsp;в&nbsp;аудиоформате.
            В&nbsp;книжном интернет магазине Вы&nbsp;можете выбрать любые книги на&nbsp;Ваш вкус, мы&nbsp;доставим все
            в&nbsp;сроки и&nbsp;в&nbsp;целостности. Также можно оформить книги под заказ и&nbsp;в&nbsp;аудиоформате.
            В&nbsp;книжном интернет магазине Вы&nbsp;можете выбрать любые книги на&nbsp;Ваш вкус, мы&nbsp;доставим все
            в&nbsp;сроки и&nbsp;в&nbsp;целостности. Также можно оформить книги под заказ и&nbsp;в&nbsp;аудиоформате.
        </p>
        <?php
       include '../templates/footer.php';
        ?>
    </div>
</body>

</html>